Revit 2027 API
HostedSweep.AddSegment Method
Add segments to the hosted sweep object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract void AddSegment(
	Reference targetRef
)
Public MustOverride Sub AddSegment (
	targetRef As Reference
)
public:
virtual void AddSegment(
	Reference^ targetRef
) abstract
abstract AddSegment :
        targetRef : Reference -> unit
Parameters
targetRef Reference
See Also
Reference
HostedSweep Class
Autodesk.Revit.DB Namespace